#### Terraform Format and Style `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform

module.example_staging_vpc.aws_eip.ngw["eu-west-1b"]: Refreshing state... [id=eipalloc-04e564a5a6bacf9ab]
module.example_staging_vpc.aws_vpc.webapp: Refreshing state... [id=vpc-013ba85f9381c851c]
module.example_staging_vpc.aws_internet_gateway.public: Refreshing state... [id=igw-0d6be2a49253325d0]
module.example_staging_vpc.aws_subnet.private["10.0.4.0/24"]: Refreshing state... [id=subnet-0846d1e0b51ded0a4]
module.example_staging_vpc.aws_subnet.public["10.0.1.0/24"]: Refreshing state... [id=subnet-01a103cc645f1a3d7]
module.example_staging_vpc.aws_route_table.public: Refreshing state... [id=rtb-0cf7aea7d59007c63]
module.example_staging_vpc.aws_route_table_association.public["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-0d10aeaee04dd1c4e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.example_staging_vpc.aws_eip.ngw["eu-west-1b"] is tainted, so must be replaced
-/+ resource "aws_eip" "ngw" {
      ~ allocation_id            = "eipalloc-04e564a5a6bacf9ab" -> (known after apply)
      ~ arn                      = "arn:aws:ec2:eu-west-1:654654301190:elastic-ip/eipalloc-04e564a5a6bacf9ab" -> (known after apply)
      + association_id           = (known after apply)
      + carrier_ip               = (known after apply)
      + customer_owned_ip        = (known after apply)
      ~ id                       = "eipalloc-04e564a5a6bacf9ab" -> (known after apply)
      + instance                 = (known after apply)
      + ipam_pool_id             = (known after apply)
      ~ network_border_group     = "eu-west-1" -> (known after apply)
      + network_interface        = (known after apply)
      + private_dns              = (known after apply)
      + private_ip               = (known after apply)
      + ptr_record               = (known after apply)
      ~ public_dns               = "ec2-34-246-166-83.eu-west-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                = "34.246.166.83" -> (known after apply)
      ~ public_ipv4_pool         = "amazon" -> (known after apply)
        tags                     = {
            "Application" = "enplat"
            "Environment" = "staging"
            "Name"        = "enplat-staging-ngw-eip-eu-west-1b"
            "Region"      = "eu-west-1"
        }
      ~ vpc                      = true -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.example_staging_vpc.aws_nat_gateway.private["eu-west-1b"] will be created
  + resource "aws_nat_gateway" "private" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-01a103cc645f1a3d7"
      + tags                               = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-ngw-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + tags_all                           = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-ngw-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
    }

  # module.example_staging_vpc.aws_route_table.private["eu-west-1b"] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-private-rt-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + tags_all         = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-private-rt-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + vpc_id           = "vpc-013ba85f9381c851c"
    }

  # module.example_staging_vpc.aws_route_table_association.private["10.0.4.0/24"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0846d1e0b51ded0a4"
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pushed by: @ridasaleemsage, Action: `pull_request`*